#ifndef __LQ_UART_H
#define __LQ_UART_H


//-------------------------------------------------------------------------*
//函数名: UART_PutChar                                                        
//功  能: 发送一个字节                                                       
//参  数: base:模块名如：UART0 
//         ch: 发送的字节
//返  回: 无                                                              
//简  例: UART_PutChar (UART4, 0x66);                               
//-------------------------------------------------------------------------*
void UART_PutChar(UART_Type *base, char ch);


void UART_PutUint16_t(uint16_t adata);
//-------------------------------------------------------------------------*
//函数名: UART_PutBuff                                                        
//功  能: 发送指定len个字节长度数组 （包括 NULL 也会发送）                                                       
//参  数: base:模块名如：UART0 
//        buff: 发送的地址、
//        len : 发送指定长度
//返  回: 无                                                              
//简  例: UART_PutBuff (UART4, "123456789",5);实际发送5个字节‘1’‘2’‘3’‘4’‘5’                               
//-------------------------------------------------------------------------*
void UART_PutBuff(UART_Type *base, uint8_t *buff, uint32_t len);



//-------------------------------------------------------------------------*
//函数名: UART_PutStr                                                        
//功  能: 发送字符串(遇 NULL 停止发送)                                                       
//参  数: base:模块名如：UART0 
//        str: 发送的地址、
//返  回: 无                                                              
//简  例: UART_PutStr (UART4, "123456789");实际发送9个字节                              
//-------------------------------------------------------------------------*
void UART_PutStr(UART_Type *base, char *str);



//-------------------------------------------------------------------------*
//函数名: UART_GetChar                                                        
//功  能: 发送字符串(遇 NULL 停止发送)                                                       
//参  数: base:模块名如：UART0 
//返  回: 串口收到的数据                                                               
//简  例: UART_GetChar (UART4); 获取串口收到的数据                              
//-------------------------------------------------------------------------*
char UART_GetChar(UART_Type *base);



/**
  * @brief    串口4初始化
  *
  * @param    无
  *
  * @return   无
  *
  * @note     波特率 115200
  *
  * @example  
  *
  * @date     2019/4/23 星期二
  */
void UART4_Init(void);
/*------------------------------------------------------------------------------------------------------
【函    数】Test_Uart
【功    能】测试UART 
【参    数】无
【返 回 值】无
【实    例】Test_PIT(); //测试PIT定时器
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_Uart(void);
#endif
